Repository: common-repository/na-splatky-tb
Catalog: languages/na-splatky-tb-*.po
Languages: sk_sk

source: The order total is too low (below %1$s) for purchase through Tatra banka %2$s
sk_sk: Suma objednávky je príliš nízka (pod %1$s) pre nákup cez Tatra banka %2$s

source: The order total is too high (above %s) for purchase through Tatra banka %2$s
sk_sk: Suma objednávky je príliš vysoká (nad %1$s) pre nákup cez Tatra banka %2$s

source: Please, provide phone number in international format, e.g. %s (spaces are not required)
sk_sk: Prosím, zadajte telefónne číslo v medzinárodnom formáte, napr. %s (medzery nie sú povinné)

source: Compute %s
sk_sk: Vypočítať %s

source: The value of your purchase is below the minimum value %s.
sk_sk: Hodnota vášho nákupu je aktuálne menšia ako minimálny limit %s.

source: The value of your purchase is above the maximum value %s.
sk_sk: Hodnota vášho nákupu aktuálne prekračuje maximálny limit %s.

source: Installment based buy via loan from Tatra banka using %s service
sk_sk: Splátkový nákup prostredníctvom služby Tatra banka %s

source: Enable/Disable
sk_sk: Povoliť/Zakázať

source: Enable %s Payment
sk_sk: Povoliť platbu %s

source: Title
sk_sk: Názov brány

source: This controls the title which the user sees during checkout.
sk_sk: Názov platobnej brány, ktorý vidí zákazník v pokladni.

source: Gateway Description
sk_sk: Popis brány

source: Gateway description when selected during checkout.
sk_sk: Popis platobnej brány, ktorý vidí zákazník v pokladni.

source: API key
sk_sk: API kľúč

source: Client ID for communication with API.
sk_sk: ID klienta pre komunikáciu s API (client_id)

source: Application secret
sk_sk: Aplikačné heslo

source: Client secret for communication with API.
sk_sk: Heslo klienta pre komunikáciu s API (client_secret)

source: Sandbox Mode
sk_sk: Sandbox mód

source: Enable sandbox mode.
sk_sk: Aktivovať sandbox mód.

source: Debug Mode
sk_sk: Režim hľadania chýb

source: Write extensive information into plugin log.
sk_sk: Zapisuje do logu pluginu podrobné informácie.

source: Do you have a technical issue with the plugin? Contact us at %s
sk_sk: Máte s pluginom technické problémy? Kontaktujte nás na %s

source: Support request for plugin "%1$s" at domain "%2$s"
sk_sk: Žiadosť o podporu pre doplnok "%1$s" na doméne "%2$s"

source: Payment gateway does not support selected currency
sk_sk: Táto platobná brána nepodporuje zvolenú menu

source: Unable to proceed with redirect to application
sk_sk: Nie je možné pokračovať na podanie žiadosti o úver

source: Pick one of the options to complete the purchase.
sk_sk: Vyberte si jednu z možností pre dokončenie nákupu.

source: Retry payment with Tatra banka %s
sk_sk: Zopakujte platbu pomocou Tatra banka %s

source: Select another payment method
sk_sk: Vybrať iný spôsob platby

source: It seems, that you did not finish the whole Tatra banka %s process.
sk_sk: Zdá sa, že ste nedokončili celý proces Tatra banka %s.

source: We are now waiting for updates for your loan application status. You should receive any updates via email within 24 hours.
sk_sk: Čakáme na upozornenie o zmene stavu vašej žiadosti. Akékoľvek zmeny by ste dostať mailom v najbližších 24 hodinách.

source: If you want, you may refresh this page to see any updates now.
sk_sk: Ak chcete, môžete obnoviť túto stránku a zobraziť všetky aktualizácie.

source: Refresh the page
sk_sk: Obnoviť stránku

source: Congratulations, your loan application was approved and order is now paid.
sk_sk: Gratulujeme, vaše financovanie nákupu bolo schválené a tovar zaplatený.

source: We are sorry, but the payment method chosen for your order could not be processed.
sk_sk: Je nám ľúto, ale vybraný spôsob platby za Váš nákup nebolo možné zrealizovať.

source: The retry payment link has expired. Please go back and refresh the page or try ordering again.
sk_sk: Platnosť odkazu na zopakovanie platby vypršala. Vráťte sa prosím a obnovte stránku alebo skúste objednať znova.

source: The retry payment process has failed for order %s. Please try ordering again.
sk_sk: Proces opätovného pokusu o platbu pre objednávku %s zlyhal. Prosím skúste objednávku zopakovať.

source: We cannot find any order you purchased via Tatra banka %s, if this is a mistake, please contact us to resolve this issue.
sk_sk: Nemôžeme nájsť žiadnu objednávku, ktorú ste zaplatili cez Tatra banka %s, ak ide o chybu, kontaktujte nás, aby sme problém vyriešili.

source: Return to homepage
sk_sk: Vrátiť sa na hlavnú stránku

source: Settings
sk_sk: Nastavenia

source: Plugin Tatra banka %1$s is enabled but does nothing, because it requires %2$s to work correctly.
sk_sk: Plugin Tatra banka %1$s je povolený, ale nič nerobí, pretože vyžaduje %2$s na to, aby mohol fungovať správne.

source: Custom installment amount can be configured in loan application after submitting your order.
sk_sk: Vlastnú výšku splátok bude možné nastaviť pri žiadosti o splátkový predaj po potvrdení vašej objednávky.

source: Pay off quickly
sk_sk: Splatím rýchlo

source: Favorite choice
sk_sk: Obľúbená voľba

source: Low payments
sk_sk: Nízke splátky

source: %s month
sk_sk: %s / mes.

source: %s / month
sk_sk: %s / mes.

source: Loan amount
sk_sk: Výška úveru

source: Monthly payment
sk_sk: Mesačná splátka

source: Interest rate
sk_sk: Úroková sadzba

source: Loan fee
sk_sk: Poplatok za úver

source: EAPR
sk_sk: RPMN

source: Total amount
sk_sk: Celková čiastka

source: Continue via %s
sk_sk: Pokračovať s %s

source: Installment settings
sk_sk: Nastavenie splátok

source: Discover all benefits of paying via %s
sk_sk: Objavte všetky benefity platenia s %s

source: Purchase value
sk_sk: Hodnota nákupu
